#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
data.azurerm_resource_group.rg: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae]
data.azurerm_user_assigned_identity.msi: Reading...
data.azurerm_container_app_environment.env: Reading...
data.azurerm_key_vault.kv: Reading...
data.azurerm_container_registry.acr: Reading...
data.azurerm_key_vault.kv: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.KeyVault/vaults/kv-biotrackr-prod-ae]
data.azurerm_user_assigned_identity.msi: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae]
data.azurerm_container_app_environment.env: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae]
data.azurerm_container_registry.acr: Read complete after 2s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae]
azurerm_container_app_job.job: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/jobs/biotrackr-auth-tokenrefresh]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app_job.job will be updated in-place
  ~ resource "azurerm_container_app_job" "job" {
        id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/jobs/biotrackr-auth-tokenrefresh"
        name                         = "biotrackr-auth-tokenrefresh"
        tags                         = {
            "Application" = "biotrackr"
            "Component"   = "Auth"
            "environment" = "Production"
            "owner"       = "willvelida"
        }
        # (8 unchanged attributes hidden)

      ~ template {
          ~ container {
              ~ image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth:c0b81ab7ba020f1c5a130e261770002eb9f74d96" -> "acrbiotrackrprodae.azurecr.io/biotrackr-auth:d5d11c63dc2e503c22d99463ba69416b6d8bc173"
                name              = "biotrackr-auth-tokenrefresh"
                # (5 unchanged attributes hidden)

              + env {
                  + name  = "keyvaulturl"
                  + value = "https://kv-biotrackr-prod-ae.vault.azure.net/"
                }
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.key_vault_secrets_officer_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.KeyVault/vaults/kv-biotrackr-prod-ae"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*